[
  {
    "id": "2026-01-13",
    "meetupId": 1,
    "title": "WSAG Meetup #1",
    "slug": "wsag-meetup-1",
    "date": "January 13, 2026",
    "time": "18:00",
    "endTime": "21:00",
    "description": {
      "pl": "Dołącz do inauguracyjnego spotkania Warsaw Software Architecture Group! Agenda i prelegenci zostaną wkrótce ogłoszeni.",
      "en": "Join us for the inaugural Warsaw Software Architecture Group meetup! Agenda and speakers to be announced soon."
    },
    "longDescription": {
      "pl": "Z radością uruchamiamy Warsaw Software Architecture Group z naszym pierwszym spotkaniem! Wydarzenie obejmie trzy doskonałe prezentacje dotyczące tematów architektury oprogramowania.\n\nTo świetna okazja, aby poznać innych architektów oprogramowania, dzielić się wiedzą i budować naszą lokalną społeczność architektury.",
      "en": "We're excited to launch the Warsaw Software Architecture Group with our first meetup! This event will feature three excellent presentations covering software architecture topics.\n\nThis is a great opportunity to meet fellow software architects, share knowledge, and build our local architecture community."
    },
    "location": {
      "name": "Siedziba Circle K",
      "address": "Puławska 145",
      "zipCode": "02-715",
      "city": "Warsaw, Poland",
      "mapUrl": "https://maps.google.com/embed?pb=!1m18!1m12!1m3!1d2443.6585859798344!2d20.98462631580052!3d52.22104397975899",
      "directions": "Details to be announced",
      "parking": "Details to be announced",
      "accessibility": "Details to be announced"
    },
    "speakers": [
      {
        "id": "kamil-kielbasa",
        "name": "Kamil Kiełbasa",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-1/kamil.jpeg"
      },
      {
        "id": "maciej-kacprzak",
        "name": "Maciej Kacprzak",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-1/maciej.jpeg"
      },
      {
        "id": "tomasz-ducin",
        "name": "Tomasz Ducin",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-1/tomasz.jpeg"
      }
    ],
    "presentations": [
      {
        "id": "capability-mapping-raci-daci",
        "title": {
          "pl": "Capability Mapping & Raci / Daci Matrix - w praktyce",
          "en": "Capability Mapping & RACI / DACI Matrix - in Practice"
        },
        "description": {
          "pl": "Capability Mapping oraz macierze RACI / DACI to proste, ale bardzo skuteczne narzędzia, które pomagają uporządkować sposób działania organizacji. Podczas prezentacji pokażę, jak wykorzystać je w praktyce do zrozumienia i zaprojektowania flow decyzyjności, jasnego podziału odpowiedzialności oraz świadomego doboru wymaganego skillsetu.<br/><br/>Na realnych przykładach omówimy, jak te techniki wspierają architektów i liderów w budowaniu organizacji, które podejmują decyzje szybciej, działają spójniej i lepiej radzą sobie ze skalą oraz zmianą.",
          "en": "Capability Mapping and RACI / DACI matrices are simple yet highly effective tools that help organize how an organization operates. During this presentation, I will show how to use them in practice to understand and design decision-making flows, clear division of responsibilities, and conscious selection of required skill sets.<br/><br/>Using real-world examples, we will discuss how these techniques support architects and leaders in building organizations that make decisions faster, operate more cohesively, and better handle scale and change."
        },
        "speakerId": "kamil-kielbasa",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": [
          {
            "type": "recording",
            "title": { "pl": "Nagranie", "en": "Recording" },
            "url": "https://youtu.be/eLx0FYplzUw"
          },
          {
            "type": "slides",
            "title": { "pl": "Slajdy", "en": "Slides" },
            "url": "https://www.canva.com/design/DAG-GQblNzw/qB2bGPx3UXiZQMVxTRYBMQ/view"
          },
          {
            "type": "template",
            "title": { "pl": "Szablon RACI", "en": "RACI Template" },
            "url": "https://miro.com/templates/raci-matrix-template/"
          },
          {
            "type": "template",
            "title": { "pl": "Szablon Business Capability Canvas", "en": "Business Capability Canvas Template" },
            "url": "https://miro.com/templates/business-capability-canvas-template/"
          }
        ]
      },
      {
        "id": "piekny-kod-to-za-malo",
        "title": {
          "pl": "Piękny kod to za mało – mój kurs startupowy za 100 tys. zł",
          "en": "Beautiful Code Is Not Enough – My 100k PLN Startup Course"
        },
        "description": {
          "pl": "Jeśli jesteś programistą, który myśli o własnym startupie, ta prezentacja pomoże Ci nie powtórzyć błędów, za które ja zapłaciłem ok. 100 tys. zł. Na przykładzie mojego startupu pokażę, dlaczego piękny kod i dopięta architektura są niewystarczające. Bez sprzedaży, marketingu i ciągłej <b>walidacji na klientach, którzy wyciągają gotówkę, a nie tylko chwalą pomysł</b>, nawet najlepiej napisana aplikacja ma małe szanse na przetrwanie. Opowiem o kluczowych błędach w myśleniu, założeniach i decyzjach biznesowych, które popełniłem po drodze – tak, abyś mógł zobaczyć je zboku, zanim zainwestujesz własny czas i pieniądze.",
          "en": "If you're a programmer thinking about starting your own startup, this presentation will help you avoid the mistakes I paid about 100k PLN for. Using my startup as an example, I'll show why beautiful code and polished architecture are not enough. Without sales, marketing, and constant <b>validation with customers who actually pay money, not just praise your idea</b>, even the best-written application has little chance of survival. I'll share the key mistakes in thinking, assumptions, and business decisions I made along the way – so you can see them from the outside before investing your own time and money."
        },
        "speakerId": "maciej-kacprzak",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": [
          {
            "type": "recording",
            "title": { "pl": "Nagranie", "en": "Recording" },
            "url": "https://youtu.be/RIp9T8E3juc"
          },
          {
            "type": "book",
            "title": { "pl": "Książka", "en": "Book" },
            "url": "https://www.amazon.pl/dp/1492180742"
          },
          {
            "type": "slides",
            "title": { "pl": "Slajdy", "en": "Slides" },
            "url": "/assets/2026_01/Pi_kny kod to za ma_o_fixed.pptx"
          }
        ]
      },
      {
        "id": "techniki-efektywnej-nauki-z-llmami",
        "title": {
          "pl": "Zapomniana sztuka myślenia. Jak uczyć się z LLMami, aby nie zwiększać cognitive debt?",
          "en": "The Forgotten Art of Thinking. How to Learn with LLMs Without Increasing Cognitive Debt?"
        },
        "description": {
          "pl": "Istnieją badania wykazujące, że stosowanie LLMów powoduje zaciąganie \"długu poznawczego\" - człowiek intelektualnie idzie na skróty. LLM generuje ścianę tekstu, operator może nawet tego nie czyta - i powstaje złudne wrażenie że \"robota jest zrobiona\". Dotyczy to zarówno researchu (nie weryfikowanie źródeł - np. LLM powołujący się na nieistniejące badania - ała, politycy!), kodowania (\"I don't read what I push to production\") - ale także - i na tym się skupimy - nauki.<br/><br/>A co jeśli LLMy to narzędzie, które jednocześnie wynosi na wyżyny - jak i przerażająco ogłupia (i wszystko pomiędzy)? LLMy \"to tylko narzędzie\" - fajnie, fajnie. Ale jak go używać w praktyce aby zmaksymalizować te \"wyżyny\" i zminimalizować ogłupianie?<br/><br/>Kiedy generowanie tekstu/kodu tanieje, rozumienie i decydowanie relatywnie drożeje.<br/><br/>Sięgniemy do fundamentów kognitywistyki i odkurzymy fundamenty \"krytycznego myślenia\", aby następnie zastosować w praktyce \"naukę z LLMami\" - stosując różnorodne techniki/metody/narzędzia do budowania własnego rozumienia (i modeli mentalnych) dot. określonego zagadnienia, metod weryfikacji, metod \"pogłębiania\" (nie tylko \"zawsze jest wiele pięter wgłąb\" - ale także - gdzie się zatrzymać) - i wiele innych praktycznych wskazówek.",
          "en": "There is research showing that using LLMs leads to incurring \"cognitive debt\" - people intellectually take shortcuts. An LLM generates a wall of text, the operator may not even read it - and a false impression is created that \"the job is done.\" This applies to research (not verifying sources - e.g., an LLM citing non-existent studies - ouch, politicians!), coding (\"I don't read what I push to production\") - but also - and this is our focus - learning.<br/><br/>What if LLMs are a tool that simultaneously elevates to great heights - and terrifyingly dumbs down (and everything in between)? LLMs are \"just a tool\" - great, great. But how do you use it in practice to maximize those \"heights\" and minimize the dumbing down?<br/><br/>When generating text/code becomes cheap, understanding and decision-making become relatively more expensive.<br/><br/>We'll reach for the fundamentals of cognitive science and dust off the foundations of \"critical thinking,\" then apply \"learning with LLMs\" in practice - using diverse techniques/methods/tools to build your own understanding (and mental models) about a given topic, verification methods, methods of \"going deeper\" (not just \"there are always many levels deep\" - but also - where to stop) - and many other practical tips."
        },
        "speakerId": "tomasz-ducin",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": [
          {
            "type": "recording",
            "title": { "pl": "Nagranie", "en": "Recording" },
            "url": "https://youtu.be/Cs9c7YW3Rnc"
          }
        ]
      }
    ],
    "agenda": [
      {
        "time": "18:00",
        "title": "Welcome & Networking",
        "description": "Registration and networking",
        "type": "networking"
      },
      {
        "time": "18:10",
        "title": "Capability Mapping & Raci / Daci Matrix - w praktyce",
        "speaker": "Kamil Kiełbasa",
        "speakerIds": ["kamil-kielbasa"],
        "presentationId": "capability-mapping-raci-daci",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "19:05",
        "title": "Piękny kod to za mało – mój kurs startupowy za 100 tys. zł",
        "speaker": "Maciej Kacprzak",
        "speakerIds": ["maciej-kacprzak"],
        "presentationId": "piekny-kod-to-za-malo",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "20:00",
        "title": "Zapomniana sztuka myślenia. Jak uczyć się z LLMami, aby nie zwiększać cognitive debt?",
        "speaker": "Tomasz Ducin",
        "speakerIds": ["tomasz-ducin"],
        "presentationId": "techniki-efektywnej-nauki-z-llmami",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "20:55",
        "title": "Closing & Networking",
        "description": "Final Q&A and networking",
        "type": "networking"
      }
    ],
    "maxAttendees": 50,
    "registeredAttendees": 0,
    "registrationUrl": "https://pragmaticmeet.com/events/5018716c-5c2d-44f4-ae13-7cae31792322",
    "status": "completed",
    "venuePartner": {
      "name": "Circle K Business Centre Warsaw",
      "url": "https://www.circlek.pl/",
      "logo": "/assets/2026_01/logo-full-color-rgb_logo-Warsaw.png"
    },
    "tags": ["architecture", "community", "networking"],
    "prerequisites": [],
    "targetAudience": [
      "Software Architects",
      "Senior Developers",
      "Tech Leads",
      "Engineering Managers"
    ]
  },
  {
    "id": "2026-02-25",
    "meetupId": 2,
    "title": "WSAG Meetup #2",
    "slug": "wsag-meetup-2",
    "date": "February 25, 2026",
    "time": "18:00",
    "endTime": "21:00",
    "description": {
      "pl": "Dołącz do drugiego spotkania Warsaw Software Architecture Group! Tym razem porozmawiamy o cyberbezpieczeństwie w CI/CD oraz HTMX jako alternatywie dla złożonych frameworków JS.",
      "en": "Join us for the second Warsaw Software Architecture Group meetup! This time we'll discuss cybersecurity in CI/CD and HTMX as an alternative to complex JS frameworks."
    },
    "longDescription": {
      "pl": "Z radością zapraszamy na drugie spotkanie WSAG w Warszawskiej Wyższej Szkole Informatyki! Wydarzenie obejmie dwie prezentacje: ocena cyberbezpieczeństwa jako część CI/CD oraz HTMX jako podejście do budowania aplikacji webowych.\n\nTo świetna okazja, aby poznać innych architektów oprogramowania, dzielić się wiedzą i kontynuować budowanie naszej lokalnej społeczności architektury.",
      "en": "We're thrilled to host the second WSAG meetup at Warszawska Wyższa Szkoła Informatyki! This event will feature two presentations: cybersecurity assessment as part of CI/CD and HTMX as an approach to building web applications.\n\nThis is a great opportunity to meet fellow software architects, share knowledge, and continue building our local architecture community."
    },
    "location": {
      "name": "Warszawska Wyższa Szkoła Informatyki",
      "address": "Józefa Lewartowskiego 17",
      "zipCode": "00-169",
      "city": "Warsaw, Poland",
      "mapUrl": "",
      "directions": "Aula 209",
      "parking": "Details to be announced",
      "accessibility": "Details to be announced"
    },
    "speakers": [
      {
        "id": "mateusz-konicki",
        "name": "Mateusz Konicki",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-2/mateusz.jpeg"
      },
      {
        "id": "marcin-golenia",
        "name": "Marcin Golenia",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-2/marcin.png"
      },
      {
        "id": "tomasz-ducin",
        "name": "Tomasz Ducin",
        "role": "",
        "company": "",
        "bio": "",
        "photo": "/images/speakers/meetup-2/tomasz.jpeg"
      }
    ],
    "presentations": [
      {
        "id": "ocena-cyberbezpieczenstwa-cicd",
        "title": {
          "pl": "Ocena cyberbezpieczeństwa jako część CI/CD",
          "en": "Cybersecurity Assessment as Part of CI/CD"
        },
        "description": {
          "pl": "Cyberbezpieczeństwo to już nie opcja, ale konieczność w każdym projekcie IT. Pojawiające się obecnie regulacje mogą spowodować ból głowy u każdej osoby pracującej w IT, niezależnie od pełnionej roli. Jednym ze sposobów zmniejszenia nakładu pracy jest integracja procesów bezpieczeństwa - SAC, SAST, skanowania podatności oraz testów zgodnych z OWASP - bezpośrednio w pipeline'ach CI/CD. W trakcie prezentacji pokażę zarówno jak mierzyć, ale również analizować wyniki testów, ograniczając zarożenia pojawiające się w projekcie.",
          "en": "Cybersecurity is no longer optional but a necessity in every IT project. Emerging regulations can cause headaches for anyone working in IT, regardless of their role. One way to reduce the workload is to integrate security processes - SAC, SAST, vulnerability scanning, and OWASP-compliant testing - directly into CI/CD pipelines. During this presentation, I'll show how to both measure and analyze test results, reducing threats that emerge in the project."
        },
        "speakerId": "mateusz-konicki",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": []
      },
      {
        "id": "htmx-aplikacje-webowe",
        "title": {
          "pl": "HTMX: Aplikacje webowe dla zmęczonych.",
          "en": "HTMX: Web Applications for the Weary."
        },
        "description": {
          "pl": "Zmęczeni niekończącą się rotacją frameworków JavaScript, z których każdy obiecuje przyszłość, ale wprowadza tylko większą złożoność? Nie jesteś sam. W tej prezentacji podzielę się moją frustracją związaną z ciągłymi zmianami w świecie frontendowym i wyjaśnię, dlaczego postanowiłem zrobić krok wstecz. Przedstawiam HTMX, prostą, ale potężną bibliotekę, która tchnie nowe życie w renderowanie po stronie serwera (SSR), umożliwiając tworzenie dynamicznych, interaktywnych doświadczeń bez rozdmuchanej ilości JavaScript.<br/><br/>Przyjrzymy się, jak HTMX pozwala budować nowoczesne aplikacje webowe, zachowując prostotę, szybkość i łatwość w utrzymaniu – wykorzystując mocne strony sieci zamiast walczyć z nimi. Jeśli kiedykolwiek marzyłeś o sposobie, aby renderowanie po stronie serwera znów stało się ekscytujące, ta prezentacja jest dla Ciebie.",
          "en": "Tired of the never-ending rotation of JavaScript frameworks, each promising the future but only introducing more complexity? You're not alone. In this presentation, I'll share my frustration with constant changes in the frontend world and explain why I decided to take a step back. I present HTMX, a simple yet powerful library that breathes new life into server-side rendering (SSR), enabling the creation of dynamic, interactive experiences without bloated JavaScript.<br/><br/>We'll explore how HTMX allows building modern web applications while maintaining simplicity, speed, and ease of maintenance – leveraging the web's strengths instead of fighting against them. If you've ever dreamed of a way to make server-side rendering exciting again, this presentation is for you."
        },
        "speakerId": "marcin-golenia",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": []
      },
      {
        "id": "zapomniana-sztuka-myslenia",
        "title": {
          "pl": "Zapomniana sztuka myślenia. Jak uczyć się z LLMami, aby nie zwiększać cognitive debt?",
          "en": "The Forgotten Art of Thinking. How to Learn with LLMs Without Increasing Cognitive Debt?"
        },
        "description": {
          "pl": "Istnieją badania wykazujące, że stosowanie LLMów powoduje zaciąganie \"długu poznawczego\" - człowiek intelektualnie idzie na skróty. LLM generuje ścianę tekstu, operator może nawet tego nie czyta - i powstaje złudne wrażenie że \"robota jest zrobiona\". Dotyczy to zarówno researchu (nie weryfikowanie źródeł - np. LLM powołujący się na nieistniejące badania - ała, politycy!), kodowania (\"I don't read what I push to production\") - ale także - i na tym się skupimy - nauki.<br/><br/>A co jeśli LLMy to narzędzie, które jednocześnie wynosi na wyżyny - jak i przerażająco ogłupia (i wszystko pomiędzy)? LLMy \"to tylko narzędzie\" - fajnie, fajnie. Ale jak go używać w praktyce aby zmaksymalizować te \"wyżyny\" i zminimalizować ogłupianie?<br/><br/>Kiedy generowanie tekstu/kodu tanieje, rozumienie i decydowanie relatywnie drożeje.<br/><br/>Sięgniemy do fundamentów kognitywistyki i odkurzymy fundamenty \"krytycznego myślenia\", aby następnie zastosować w praktyce \"naukę z LLMami\" - stosując różnorodne techniki/metody/narzędzia do budowania własnego rozumienia (i modeli mentalnych) dot. określonego zagadnienia, metod weryfikacji, metod \"pogłębiania\" (nie tylko \"zawsze jest wiele pięter wgłąb\" - ale także - gdzie się zatrzymać) - i wiele innych praktycznych wskazówek.",
          "en": "There is research showing that using LLMs leads to incurring \"cognitive debt\" - people intellectually take shortcuts. An LLM generates a wall of text, the operator may not even read it - and a false impression is created that \"the job is done.\" This applies to research (not verifying sources - e.g., an LLM citing non-existent studies - ouch, politicians!), coding (\"I don't read what I push to production\") - but also - and this is our focus - learning.<br/><br/>What if LLMs are a tool that simultaneously elevates to great heights - and terrifyingly dumbs down (and everything in between)? LLMs are \"just a tool\" - great, great. But how do you use it in practice to maximize those \"heights\" and minimize the dumbing down?<br/><br/>When generating text/code becomes cheap, understanding and decision-making become relatively more expensive.<br/><br/>We'll reach for the fundamentals of cognitive science and dust off the foundations of \"critical thinking,\" then apply \"learning with LLMs\" in practice - using diverse techniques/methods/tools to build your own understanding (and mental models) about a given topic, verification methods, methods of \"going deeper\" (not just \"there are always many levels deep\" - but also - where to stop) - and many other practical tips."
        },
        "speakerId": "tomasz-ducin",
        "duration": 30,
        "level": "intermediate",
        "language": "pl",
        "tags": [],
        "resources": [],
        "cancelled": true,
        "cancellationNote": {
          "pl": "Prezentacja odwołana z powodu choroby prelegenta",
          "en": "Presentation cancelled due to speaker illness"
        }
      }
    ],
    "agenda": [
      {
        "time": "18:00",
        "title": "Welcome & Networking",
        "description": "Registration and networking",
        "type": "networking"
      },
      {
        "time": "18:10",
        "title": "Ocena cyberbezpieczeństwa jako część CI/CD",
        "speaker": "Mateusz Konicki",
        "speakerIds": ["mateusz-konicki"],
        "presentationId": "ocena-cyberbezpieczenstwa-cicd",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "19:05",
        "title": "HTMX: Aplikacje webowe dla zmęczonych.",
        "speaker": "Marcin Golenia",
        "speakerIds": ["marcin-golenia"],
        "presentationId": "htmx-aplikacje-webowe",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "20:00",
        "title": "Zapomniana sztuka myślenia. Jak uczyć się z LLMami, aby nie zwiększać cognitive debt?",
        "speaker": "Tomasz Ducin",
        "speakerIds": ["tomasz-ducin"],
        "presentationId": "zapomniana-sztuka-myslenia",
        "description": "",
        "type": "presentation"
      },
      {
        "time": "20:55",
        "title": "Closing & Networking",
        "description": "Final Q&A and networking",
        "type": "networking"
      }
    ],
    "maxAttendees": 150,
    "registeredAttendees": 0,
    "status": "upcoming",
    "venuePartner": {
      "name": "Warszawska Wyższa Szkoła Informatyki",
      "url": "https://wwsi.edu.pl/",
      "logo": "/images/partners/wwsi_logo.png"
    },
    "tags": ["architecture", "community", "networking"],
    "prerequisites": [],
    "targetAudience": [
      "Software Architects",
      "Senior Developers",
      "Tech Leads",
      "Engineering Managers"
    ]
  }
]